In [7]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

## Lambda

In [2]:
f = lambda x,y: x + y
f(1, 4)

5

## map 함수

In [5]:
ex = [1,2,3,4,5]
f = lambda x: x ** 2
print(list(map(f, ex))) # 앞에 list 붙여야 리스트가 반환됨. 안붙이면 리스트 주소값 반환
print(map(f, ex))

[1, 4, 9, 16, 25]
<map object at 0x000001FBD3565F48>

In [12]:
df = pd.read_csv("./data/wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [13]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [14]:
df["sex_code"] = df.sex.map({"male":0, "female":1})
df.head(5)

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

## Replace function

In [18]:
# df.sex.replace(['male', 'female'],
#               [0,1], inplace=True)
df.head(5)

           earn  height  sex   race  ed  age  sex_code
0  79571.299011   73.89    0  white  16   49         0
1  96396.988643   66.23    1  white  16   62         1
2  48710.666947   63.77    1  white  16   33         1
3  80478.096153   63.22    1  other  16   95         1
4  82089.345498   63.08    1  white  17   43         1

## Apply for dataframe

In [21]:
df_info = df[["earn", "height", "age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [22]:
f = lambda x : x.max() - x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [23]:
def f(x):
    return Series([x.min(), x.max()], index=["min", "max"])
df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

## Applymap

In [26]:
f = lambda x : -x
df_info.applymap(f).head(5)

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

## series 단위에 apply
## df 단위에 applymap